{
  "backend/main.mo": "Actor implementing contact form submission with rate limiting, admin‑gated retrieval, and AccessControl integration.",
  "feature_evidence.json": "Feature evidence report describing a visual theme update and listing related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping frontend file paths to short descriptive summaries of their components and pages.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens for light and dark themes and applying global background and text utilities.",
  "frontend/index.html": "Basic HTML document mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and routes for Home, Services, About, and Contact pages.",
  "frontend/src/components/about/DifferentiatorList.tsx": "Grid component rendering differentiator items with icons, titles, and descriptions.",
  "frontend/src/components/contact/ContactForm.tsx": "Validated contact form handling input, client‑side errors, submission, and success or error feedback states.",
  "frontend/src/components/contact/SubmissionFeedback.tsx": "Alert component showing success or detailed error messages with reset handling and rate‑limit detection.",
  "frontend/src/components/services/ServiceCard.tsx": "Service card displaying icon, details, included items, outcomes, and a consultation CTA.",
  "frontend/src/components/site/CalloutCard.tsx": "Reusable callout card with optional icon, description, and content slot.",
  "frontend/src/components/site/Footer.tsx": "Footer with company info, navigation links, contact text, and attribution section.",
  "frontend/src/components/site/Hero.tsx": "Renders a hero section with headline, subheadline, optional background image, and children content.",
  "frontend/src/components/site/Section.tsx": "Provides a layout section with variant and size styling options wrapping children in a container.",
  "frontend/src/components/site/SiteLayout.tsx": "Defines the overall site layout including top navigation, routed content outlet, and footer.",
  "frontend/src/components/site/TopNav.tsx": "Implements a responsive navigation bar with desktop links, mobile sheet menu, and routing actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling identity loading, login, logout, and status.",
  "frontend/src/hooks/usePageMeta.ts": "Updates the document title and meta description when pages mount and restores defaults on unmount.",
  "frontend/src/hooks/useSubmitContact.ts": "Defines a mutation to submit contact forms through the backend actor and invalidates related queries.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in query and identity providers and loading global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with metadata, company story sections, and differentiator content.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with metadata, contact form, contact details, and expectations information.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero messaging, procurement-focused sections, and navigation-driven CTAs using predefined content arrays.",
  "frontend/src/pages/ServicesPage.tsx": "Displays structured service offerings with icons, descriptions, features, and outcomes, along with page metadata setup.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, persist, and clear URL parameters and session-stored values for routing and state retention.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, containers, shadows, and plugins for the site's design system.",
  "project_state.json": "Stores project metadata, requirements, features, and current state for guiding development of the Joynexm website."
}